# =====================================================
# Timing Constraints
# =====================================================

# -----------------------------------------------------
# Setup Timing
# -----------------------------------------------------

set_max_delay 5.0 \
-from [all_inputs] \
-to [all_outputs]

# -----------------------------------------------------
# Hold Timing
# -----------------------------------------------------

set_min_delay 1.0 \
-from [all_inputs] \
-to [all_outputs]

# -----------------------------------------------------
# Register Constraints
# -----------------------------------------------------

set_max_fanout 32 \
[current_design]