# =====================================================
# Top-Level SDC Constraints
# =====================================================

# -----------------------------------------------------
# Primary Clock
# -----------------------------------------------------

create_clock \
-name clk \
-period 10.000 \
[get_ports clk]

# -----------------------------------------------------
# Clock Uncertainty
# -----------------------------------------------------

set_clock_uncertainty 0.2 \
[get_clocks clk]

# -----------------------------------------------------
# Input Delays
# -----------------------------------------------------

set_input_delay 2.0 \
-clock clk \
[all_inputs]

# -----------------------------------------------------
# Output Delays
# -----------------------------------------------------

set_output_delay 2.0 \
-clock clk \
[all_outputs]